app/controllers/api/groups_controller.rb

INSERT INTO "groups" ("title", "category", "location", "description", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @group = Group.new(group_params)
    @group.creator_id = current_user.id
    if @group.save