app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.location = "No indicated hometown yet!"
    @user.interests = "No indicated interests yet!"
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"